// 收藏列表
const tags = [
  "G12",
  "G10",
  "休闲",
  "第四期重建用的幻雷矿砂（检）",
  "第四期重建用的幻风树枝（检）",
  "第四期重建用的幻火石（检）",
  "第四期重建用的幻土草（检）",
  "第四期重建用的最高级",
  "第四期重建用的特供",
  "翠绿隔离墙",
];
// 常用查询
const tabTags = [
  {
    name: "四期重建奖励",
    data: [
      "休闲外套装备箱",
      "库啵装备箱",
      "触手",
      "翠绿隔离墙",
      "春意隔离墙",
      "演技教材·吃饭团",
      "演技教材·吃苹果",
      "演技教材·扫地",
      "大壳蟹角笛",
      "三角龙龙",
      "田园圆点阳伞",
    ],
  },
  {
    name: "往期重建",
    data: [
      "巫菲提角笛",
      "硕山羊角笛",
      "白化黑羊号角",
      "手艺工作服",
      "手艺背心",
      "手艺围裙装",
      "手艺皮鞋",
      "发型样式：传奇",
      "发型样式：斜刘海",
      "发型样式：圣翼",
      "演技教材·背靠",
      "演技教材·看书",
      "小刻耳柏洛斯",
    ],
  },
  {
    name: "染剂",
    data: [
      "无瑕白",
      "煤玉黑",
      "龙骑蓝",
      "樱桃粉",
      "宝石红",
      "炮铜黑",
      "珍珠白",
    ],
  },
  {
    name: "魔晶石",
    data: (() => {
      let stones = [
        "达识",
        "博识",
        "器识",
        "巨匠",
        "名匠",
        "魔匠",
        "武略",
        "神眼",
        "雄略",
      ];
      stones = stones
        .map((item) => item + "魔晶石捌型")
        .concat(stones.map((item) => item + "魔晶石柒型"));
      return stones;
    })(),
  },
];
