const tags = [
  "G12",
  "G10",
  "休闲",
  "第四期重建用的最高级",
  "第四期重建用的特供",
  "翠绿隔离墙",
];
const rebuild4Reward = [
  "肥肥风筝猫",
  "库啵装备箱",
  "休闲外套装备箱",
  "圣龙装备箱",
  "演技教材·吃饭团",
  "演技教材·吃苹果",
  "演技教材·扫地",
  "大壳蟹角笛",
  "三角龙龙",
  "田园圆点阳伞",
  "休闲运动鞋",
  "春意隔离墙",
  "毛绒绒宝石兽",
  "宝石兽室内鞋",
];
const Dyes = [
  "无瑕白",
  "煤玉黑",
  "龙骑蓝",
  "樱桃粉",
  "宝石红",
  "炮铜黑",
  "珍珠白",
];
let stones = [
  "达识",
  "博识",
  "器识",
  "巨匠",
  "名匠",
  "魔匠",
  "武略",
  "神眼",
  "雄略",
];
stones = stones
  .map((item) => item + "魔晶石捌型")
  .concat(stones.map((item) => item + "魔晶石柒型"));
